In [1]:
import pandas as pd
import numpy as np

## Grouping
* groupby()

In [2]:
data = pd.read_csv(r'C:\Users\omc\Desktop\Data Science\Populationoutput.csv')

In [3]:
data

,Unnamed: 0,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
0,0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
1,1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
2,2,Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523
3,3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540
4,0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
5,1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
6,3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540

In [4]:
del data['Unnamed: 0']

In [5]:
datagb = data.groupby('State')
#returns grouby object

In [6]:
datagb.size()

State
Andaman & Nicobar Islands    2
Andhra Pradesh               2
Arunachal Pradesh            1
Assam                        2
dtype: int64

In [7]:
datagb.groups

{'Andaman & Nicobar Islands': Int64Index([0, 4], dtype='int64'),
 'Andhra Pradesh': Int64Index([1, 5], dtype='int64'),
 'Arunachal Pradesh': Int64Index([2], dtype='int64'),
 'Assam': Int64Index([3, 6], dtype='int64')}

In [8]:
l = ['01/01/2017','02/01/2017','23/04/']

In [9]:
out = lambda l: l.split('/')[1]

In [10]:
print(out)

<function <lambda> at 0x0000000008FC29D8>

In [11]:
datagb.size()

State
Andaman & Nicobar Islands    2
Andhra Pradesh               2
Arunachal Pradesh            1
Assam                        2
dtype: int64

In [12]:
#groupby ->date

In [ ]:
#to fetch months from all years
l = ['01/01/2017','02/01/2017','23/04/2017']
for i in l:
    out = lambda i :i.split('/')[1]
    print out(i)

In [14]:
data

,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
2,Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523
3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540
4,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
5,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
6,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540